//=============================================================================
// コントロール処理 [control.cpp]
// Author : 村元翼
//=============================================================================
#include "control_zoom.h"
#include "ui.h"
#include "sound.h"
#include "manager.h"

//=============================================================================
// マクロ定義
//=============================================================================
#define ZOOM_FRAME (40)		// ズームを始めるフレーム
#define MULTI_SIZE (1.15f)	// サイズに掛ける数

//=============================================================================
// コンストラクタ
//=============================================================================
CControlZoom::CControlZoom(void)
{
}

//=============================================================================
// デストラクタ
//=============================================================================
CControlZoom::~CControlZoom()
{

}

//=============================================================================
// 初期化処理
//=============================================================================
HRESULT CControlZoom::Init()
{
	return S_OK;
}

//=============================================================================
// 終了処理
//=============================================================================
void CControlZoom::Uninit()
{

}

//=============================================================================
// 更新処理
//=============================================================================
void CControlZoom::Update(CScene *pObject)
{
	m_nFrame++;	// フレームカウント

	CUi *pUi = nullptr;
	if (!pUi)
	{
		// オブジェクトをUIクラスにキャスト
		pUi = (CUi*)pObject;

		// 位置・サイズ取得
		D3DXVECTOR3 pos;
		D3DXVECTOR3 size;
		pos = pUi->GetPos();
		size = pUi->GetSize();

		// ズームを行う
		if (m_nFrame < ZOOM_FRAME)
		{
			// サイズを大きくする
			size.x *= MULTI_SIZE;
			size.y *= MULTI_SIZE;

			pUi->SetPos(pos, size);	// 位置・サイズ更新
		}
	}
}

//=============================================================================
// 生成処理
//=============================================================================
CControlZoom *CControlZoom::Create()
{
	//インスタンスの生成
	CControlZoom *pControlZoom = nullptr;

	if (!pControlZoom)
	{
		pControlZoom = new CControlZoom;

		if (pControlZoom)
		{
			pControlZoom->Init();	// 初期化
		}
	}
	return pControlZoom;

}