//=============================================================================
// コントロール処理 [control.h]
// Author : ムラモトツバサ
//=============================================================================
#ifndef _CONTROL_ZOOM_H_
#define _CONTROL_ZOOM_H_
#include "main.h"
#include "control.h"

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CScene;

//*****************************************************************************
// コントロールクラス
//*****************************************************************************
class CControlZoom : public CControl
{
public:
	CControlZoom();							// コンストラクタ
	~CControlZoom();						// デストラクタ
	HRESULT Init(void);						// 初期化処理
	void Uninit(void);						// 終了処理
	void Update(CScene *pObject);			// 更新処理
	static CControlZoom *Create(void);		// 生成処理
};

#endif	