//=============================================================================
// コントロール処理 [control_fade.cpp]
// Author : ムラモトツバサ
//=============================================================================
#include "control_throw.h"

//=============================================================================
// マクロ定義
//=============================================================================
#define GRAVITY		(-0.1f)
#define THROW_POWER (5.0f)

//=============================================================================
// コンストラクタ
//=============================================================================
CControlThrow::CControlThrow()
{
	m_fGravity = GRAVITY;
	m_bDoOnce = false;
}

//=============================================================================
// デストラクタ
//=============================================================================
CControlThrow::~CControlThrow()
{

}

//=============================================================================
// 初期化処理
//=============================================================================
HRESULT CControlThrow::Init()
{
	return S_OK;
}

//=============================================================================
// 終了処理
//=============================================================================
void CControlThrow::Uninit()
{

}

//=============================================================================
// 更新処理
//=============================================================================
void CControlThrow::Update(CScene *pObject)
{
	//// インスタンス
	//CBomb *pBomb = nullptr;
	//if (!pBomb)
	//{
	//	// オブジェクトをBillboardクラスにキャスト
	//	pBomb = (CBomb*)pObject;

	//	if (pBomb)
	//	{
	//		// なげたときの処理
	//		D3DXVECTOR3 pos = pBomb->GetPos();

	//		pos += m_move;

	//		if (m_bDoOnce)
	//		{
	//			m_move.y += m_fGravity;
	//		}
	//		else			// 最初だけ重力 / 2
	//		{
	//			m_move.x = pBomb->GetThrowDir().x * THROW_POWER;
	//			m_move.z = pBomb->GetThrowDir().z * THROW_POWER;
	//			m_move.y = THROW_POWER;
	//			m_move.y += m_fGravity / 2;
	//			m_bDoOnce = true;
	//		}

	//		pBomb->SetPos(pos);
	//	}
	//}
}

//=============================================================================
// 生成処理
//=============================================================================
CControlThrow *CControlThrow::Create()
{
	// インスタンスの生成
	CControlThrow *pControlThrow = nullptr;
	if (!pControlThrow)
	{
		pControlThrow = new CControlThrow();
		if (pControlThrow)
		{
			pControlThrow->Init();	// 初期化
		}
	}
	return pControlThrow;
}