//===============================================
// タイトルの処理
// Author:村元翼
//===============================================
#ifndef _TITLE_H_
#define _TITLE_H_

//===============================================
// インクルードファイル
//===============================================
#include "main.h"
#include "scene.h"

//===============================================
// マクロ定義
//===============================================

//===============================================
// 前方宣言
//===============================================
class CUi;
class CBg;

//===============================================
// タイトルクラスの定義
//===============================================
class CTitle
{
public:

	//------------------------------------
	// タイトル画面のページ
	//------------------------------------
	typedef enum
	{
		PAGE_01 = 0,
		PAGE_02,
		PAGE_MAX

	}TITLE_PAGE;

	//------------------------------------
	// タイトル画面の選択肢
	//------------------------------------
	typedef enum
	{
		TITLE_SELECT_01 = 0,
		TITLE_SELECT_02,
		TITLE_SELECT_03,
		TITLE_SELECT_MAX

	}TITLE_SELECT;

	//------------------------------------
	// コンストラクタ、デストラクタ
	//------------------------------------
	CTitle();
	~CTitle();

	//------------------------------------
	// プロトタイプ宣言
	//------------------------------------
	HRESULT Init(void);				// 初期化
	void Uninit(void);				// 終了
	void Update(void);				// 更新
	void Draw(void);				// 描画

private:
	//------------------------------------
	// メンバ変数
	//------------------------------------
	CUi					*m_pPressEnter;					// UIクラス
	CUi					*m_pTitleLogo;					// UIクラス
	CUi					*m_pTutorial;					// UIクラス
	CUi					*m_pSelectUi[TITLE_SELECT_MAX];	// UIクラス
	CBg					*m_pBg;							// 背景クラス
	TITLE_PAGE			m_Page;							// タイトルページ構造体
	int					m_nSelect;						// モード選択に使う

};
#endif //_TITLE_H_