//=============================================================================
// コントロール処理 [control_spread.h]
// Author:村元翼
//=============================================================================
#ifndef _CONTROL_SPREAD_H_
#define _CONTROL_SPREAD_H_
#include "main.h"
#include "control.h"

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CScene;

//*****************************************************************************
// コントロールクラス
//*****************************************************************************
class CControlSpread : public CControl
{
public:
	CControlSpread();						// コンストラクタ
	~CControlSpread();						// デストラクタ
	HRESULT Init(void);						// 初期化処理
	void Uninit(void);						// 終了処理
	void Update(CScene *pObject);			// 更新処理
	static CControlSpread *Create();		// 生成処理
};
#endif
