//=============================================================================
// コントロール処理 [control_blink.cpp]
// Author : 村元翼
//=============================================================================
#include "control_blink.h"
#include "ui.h"

//=============================================================================
// マクロ定義
//=============================================================================
#define BLINK_FRAME (30)

//=============================================================================
// コンストラクタ
//=============================================================================
CControlBlink::CControlBlink()
{

}

//=============================================================================
// デストラクタ
//=============================================================================
CControlBlink::~CControlBlink()
{

}

//=============================================================================
// 初期化処理
//=============================================================================
HRESULT CControlBlink::Init()
{
	return S_OK;
}

//=============================================================================
// 終了処理
//=============================================================================
void CControlBlink::Uninit()
{

}

//=============================================================================
// 更新処理
//=============================================================================
void CControlBlink::Update(CScene *pObject)
{
	CUi *pUi = nullptr;
	if (!pUi)
	{
		// オブジェクトをUIクラスにキャスト
		pUi = (CUi*)pObject;

		if (pUi)
		{
			// フレーム加算
			m_nFrame++;

			D3DXCOLOR color;
			color = pUi->GetCol();

			if (m_nFrame == BLINK_FRAME)
			{
				color = D3DXCOLOR(1.0f, 1.0f, 1.0f, 0.0f);	// 透明化
			}

			else if (m_nFrame == BLINK_FRAME * 2)
			{
				color = D3DXCOLOR(1.0f, 1.0f, 1.0f, 1.0f);	// 不透明化
				m_nFrame = 0;								// フレーム数リセット
			}

			pUi->SetCol(color);	// カラーの設定
		}
	}
}

//=============================================================================
// 生成処理
//=============================================================================
CControlBlink *CControlBlink::Create()
{
	//インスタンスの生成
	CControlBlink *pControlBlink = nullptr;

	if (!pControlBlink)
	{
		pControlBlink = new CControlBlink;

		if (pControlBlink)
		{
			pControlBlink->Init();
		}
	}
	return pControlBlink;
}