//=============================================================================
// コントロール処理 [control_blink.cpp]
// Author : ムラモトツバサ
//=============================================================================
#include "control_blink.h"
#include "ui.h"

//=============================================================================
// コンストラクタ
//=============================================================================
CControlBlink::CControlBlink()
{
	m_nFrame = 0;
}

//=============================================================================
// デストラクタ
//=============================================================================
CControlBlink::~CControlBlink()
{

}

//=============================================================================
// 初期化処理
//=============================================================================
HRESULT CControlBlink::Init()
{
	return S_OK;
}

//=============================================================================
// 終了処理
//=============================================================================
void CControlBlink::Uninit()
{

}

//=============================================================================
// 更新処理
//=============================================================================
void CControlBlink::Update(CScene *pObject)
{
	// フレーム加算
	m_nFrame++;

	CUi *pUi = nullptr;
	if (pUi == nullptr)
	{
		// オブジェクトをUIクラスにキャスト
		pUi = (CUi*)pObject;

		if (pUi != nullptr)
		{
			D3DXCOLOR color;
			color = pUi->GetCol();

			if (m_nFrame > 30)
			{
				// 透明化
				color = D3DXCOLOR(1.0f, 1.0f, 1.0f, 0.0f);
				pUi->SetCol(color);
			}

			if (m_nFrame > 60)
			{
				// 透明化
				color = D3DXCOLOR(1.0f, 1.0f, 1.0f, 1.0f);
				pUi->SetCol(color);
				m_nFrame = 0;
			}
		}
	}


}

//=============================================================================
// 生成処理
//=============================================================================
CControlBlink *CControlBlink::Create()
{
	//インスタンスの生成
	CControlBlink *pControlBlink = nullptr;

	if (pControlBlink == nullptr)
	{
		pControlBlink = new CControlBlink;

		if (pControlBlink != nullptr)
		{
			pControlBlink->Init();
		}
	}
	return pControlBlink;

}