//=============================================================================
// コントロール処理 [control_rise.h]
//=============================================================================
#ifndef _CONTROL_RISE_H_
#define _CONTROL_RISE_H_
#include "main.h"
#include "control.h"

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CScene;

//*****************************************************************************
// コントロールクラス
//*****************************************************************************
class CControlRise : public CControl
{
public:
	CControlRise();							// コンストラクタ
	~CControlRise();						// デストラクタ
	HRESULT Init(void);						// 初期化処理
	void Uninit(void);						// 終了処理
	void Update(CScene *pObject);			// 更新処理
	static CControlRise *Create();			// 生成処理
};

#endif
