//========================================
// ステージ
// Author:村元翼
//========================================
#ifndef _STAGE_H_
#define _STAGE_H_
#include "main.h"

//========================================
// マクロ定義
//========================================
#define MAX_OBJECT		(50)			// オブジェクトの最大数
#define MAX_PLAYER		(1)				// プレイヤーの最大数

//========================================
// 前方宣言
//========================================
class CModel_Spawner;
class CPlayer;

//------------------------------------------
// ステージクラス
//------------------------------------------
class CStage
{
public:
	//------------------------------------
	// コンストラクタ、デストラクタ
	//------------------------------------
	CStage();
	~CStage();

	//------------------------------------
	// プロトタイプ宣言
	//------------------------------------
	HRESULT Init(void);								// 初期化
	void Uninit(void);								// 終了
	void Update(void);								// 更新
	void StageSet(const char *sStageFileName);		// ステージテキストを読み込む関数
	void SetStage(const char *aStageFileName);		// モデルテキストを読み込む関数

private:
};
#endif _STAGE_H_